app-testing-e2e/src/test/resources/payloads/adms/create_schedule.xml

<?xml version="1.0" encoding="utf-8"?>
<!--
    SOAP envelope template for the CreateSchedule operation.
    All ${token} placeholders are replaced at runtime by FilePayloadLoader.

    Required tokens:
      ${username}     - WS-Security username
      ${password}     - WS-Security password (PasswordText)
      ${scheduleName} - Human-readable name for the new schedule
      ${startDate}    - ISO-8601 start datetime, e.g. 2026-04-15T08:00:00
      ${endDate}      - ISO-8601 end datetime, e.g. 2026-04-15T17:00:00
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="urn:wpm">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>${username}</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">${password}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <tns:CreateSchedule>
            <tns:CreateScheduleTc>
                <tns:scheduleName>${scheduleName}</tns:scheduleName>
                <tns:startDate>${startDate}</tns:startDate>
                <tns:endDate>${endDate}</tns:endDate>
            </tns:CreateScheduleTc>
        </tns:CreateSchedule>
    </soapenv:Body>
</soapenv:Envelope>
