app-testing-e2e/src/test/resources/payloads/adms/create_operation.xml

<?xml version="1.0" encoding="utf-8"?>
<!--
    SOAP envelope template for the CreateOperation operation.
    All ${token} placeholders are replaced at runtime by FilePayloadLoader.

    Required tokens:
      ${username}      - WS-Security username
      ${password}      - WS-Security password (PasswordText)
      ${scheduleId}    - ID returned by a prior CreateSchedule call
      ${operationName} - Human-readable name for the switching operation
      ${deviceId}      - Network device identifier
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="urn:wpm">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>${username}</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">${password}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <tns:CreateOperation>
            <tns:CreateOperationTc>
                <tns:scheduleId>${scheduleId}</tns:scheduleId>
                <tns:operationName>${operationName}</tns:operationName>
                <tns:deviceId>${deviceId}</tns:deviceId>
            </tns:CreateOperationTc>
        </tns:CreateOperation>
    </soapenv:Body>
</soapenv:Envelope>
